sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_reg.h
/* 0x24 : mjpeg_frame_size */
#define MJENC_MJPEG_FRAME_SIZE_OFFSET                           (0x24)
#define MJENC_REG_FRAME_WBLK                                    MJENC_REG_FRAME_WBLK
#define MJENC_REG_FRAME_WBLK_POS                                (0U)
#define MJENC_REG_FRAME_WBLK_LEN                                (12U)
#define MJENC_REG_FRAME_WBLK_MSK                                (((1U<<MJENC_REG_FRAME_WBLK_LEN)-1)<<MJENC_REG_FRAME_WBLK_POS)
#define MJENC_REG_FRAME_WBLK_UMSK                               (~(((1U<<MJENC_REG_FRAME_WBLK_LEN)-1)<<MJENC_REG_FRAME_WBLK_POS))
#define MJENC_REG_FRAME_HBLK                                    MJENC_REG_FRAME_HBLK
#define MJENC_REG_FRAME_HBLK_POS                                (16U)
#define MJENC_REG_FRAME_HBLK_LEN                                (12U)
#define MJENC_REG_FRAME_HBLK_MSK                                (((1U<<MJENC_REG_FRAME_HBLK_LEN)-1)<<MJENC_REG_FRAME_HBLK_POS)
#define MJENC_REG_FRAME_HBLK_UMSK                               (~(((1U<<MJENC_REG_FRAME_HBLK_LEN)-1)<<MJENC_REG_FRAME_HBLK_POS))

/* 0x28 : mjpeg_header_byte */
#define MJENC_MJPEG_HEADER_BYTE_OFFSET                          (0x28)
#define MJENC_REG_HEAD_BYTE                                     MJENC_REG_HEAD_BYTE
#define MJENC_REG_HEAD_BYTE_POS                                 (0U)
#define MJENC_REG_HEAD_BYTE_LEN                                 (12U)
#define MJENC_REG_HEAD_BYTE_MSK                                 (((1U<<MJENC_REG_HEAD_BYTE_LEN)-1)<<MJENC_REG_HEAD_BYTE_POS)
#define MJENC_REG_HEAD_BYTE_UMSK                                (~(((1U<<MJENC_REG_HEAD_BYTE_LEN)-1)<<MJENC_REG_HEAD_BYTE_POS))
#define MJENC_REG_TAIL_EXP                                      MJENC_REG_TAIL_EXP
#define MJENC_REG_TAIL_EXP_POS                                  (16U)
#define MJENC_REG_TAIL_EXP_LEN                                  (1U)
#define MJENC_REG_TAIL_EXP_MSK                                  (((1U<<MJENC_REG_TAIL_EXP_LEN)-1)<<MJENC_REG_TAIL_EXP_POS)
#define MJENC_REG_TAIL_EXP_UMSK                                 (~(((1U<<MJENC_REG_TAIL_EXP_LEN)-1)<<MJENC_REG_TAIL_EXP_POS))
#define MJENC_REG_Y0_ORDER                                      MJENC_REG_Y0_ORDER
#define MJENC_REG_Y0_ORDER_POS                                  (24U)
#define MJENC_REG_Y0_ORDER_LEN                                  (2U)
#define MJENC_REG_Y0_ORDER_MSK                                  (((1U<<MJENC_REG_Y0_ORDER_LEN)-1)<<MJENC_REG_Y0_ORDER_POS)
#define MJENC_REG_Y0_ORDER_UMSK                                 (~(((1U<<MJENC_REG_Y0_ORDER_LEN)-1)<<MJENC_REG_Y0_ORDER_POS))
#define MJENC_REG_U0_ORDER                                      MJENC_REG_U0_ORDER
#define MJENC_REG_U0_ORDER_POS                                  (26U)
#define MJENC_REG_U0_ORDER_LEN                                  (2U)
#define MJENC_REG_U0_ORDER_MSK                                  (((1U<<MJENC_REG_U0_ORDER_LEN)-1)<<MJENC_REG_U0_ORDER_POS)
#define MJENC_REG_U0_ORDER_UMSK                                 (~(((1U<<MJENC_REG_U0_ORDER_LEN)-1)<<MJENC_REG_U0_ORDER_POS))
#define MJENC_REG_Y1_ORDER                                      MJENC_REG_Y1_ORDER
#define MJENC_REG_Y1_ORDER_POS                                  (28U)
#define MJENC_REG_Y1_ORDER_LEN                                  (2U)
#define MJENC_REG_Y1_ORDER_MSK                                  (((1U<<MJENC_REG_Y1_ORDER_LEN)-1)<<MJENC_REG_Y1_ORDER_POS)
#define MJENC_REG_Y1_ORDER_UMSK                                 (~(((1U<<MJENC_REG_Y1_ORDER_LEN)-1)<<MJENC_REG_Y1_ORDER_POS))
#define MJENC_REG_V0_ORDER                                      MJENC_REG_V0_ORDER
#define MJENC_REG_V0_ORDER_POS                                  (30U)
#define MJENC_REG_V0_ORDER_LEN                                  (2U)
#define MJENC_REG_V0_ORDER_MSK                                  (((1U<<MJENC_REG_V0_ORDER_LEN)-1)<<MJENC_REG_V0_ORDER_POS)
#define MJENC_REG_V0_ORDER_UMSK                                 (~(((1U<<MJENC_REG_V0_ORDER_LEN)-1)<<MJENC_REG_V0_ORDER_POS))

/* 0x30 : mjpeg_swap_mode */
#define MJENC_MJPEG_SWAP_MODE_OFFSET                            (0x30)
#define MJENC_REG_W_SWAP_MODE                                   MJENC_REG_W_SWAP_MODE
#define MJENC_REG_W_SWAP_MODE_POS                               (0U)
#define MJENC_REG_W_SWAP_MODE_LEN                               (1U)
#define MJENC_REG_W_SWAP_MODE_MSK                               (((1U<<MJENC_REG_W_SWAP_MODE_LEN)-1)<<MJENC_REG_W_SWAP_MODE_POS)
#define MJENC_REG_W_SWAP_MODE_UMSK                              (~(((1U<<MJENC_REG_W_SWAP_MODE_LEN)-1)<<MJENC_REG_W_SWAP_MODE_POS))
#define MJENC_STS_SWAP0_FULL                                    MJENC_STS_SWAP0_FULL
#define MJENC_STS_SWAP0_FULL_POS                                (8U)
#define MJENC_STS_SWAP0_FULL_LEN                                (1U)
#define MJENC_STS_SWAP0_FULL_MSK                                (((1U<<MJENC_STS_SWAP0_FULL_LEN)-1)<<MJENC_STS_SWAP0_FULL_POS)
#define MJENC_STS_SWAP0_FULL_UMSK                               (~(((1U<<MJENC_STS_SWAP0_FULL_LEN)-1)<<MJENC_STS_SWAP0_FULL_POS))
#define MJENC_STS_SWAP1_FULL                                    MJENC_STS_SWAP1_FULL
#define MJENC_STS_SWAP1_FULL_POS                                (9U)
#define MJENC_STS_SWAP1_FULL_LEN                                (1U)
#define MJENC_STS_SWAP1_FULL_MSK                                (((1U<<MJENC_STS_SWAP1_FULL_LEN)-1)<<MJENC_STS_SWAP1_FULL_POS)
#define MJENC_STS_SWAP1_FULL_UMSK                               (~(((1U<<MJENC_STS_SWAP1_FULL_LEN)-1)<<MJENC_STS_SWAP1_FULL_POS))
#define MJENC_STS_READ_SWAP_IDX                                 MJENC_STS_READ_SWAP_IDX
#define MJENC_STS_READ_SWAP_IDX_POS                             (10U)
#define MJENC_STS_READ_SWAP_IDX_LEN                             (1U)
#define MJENC_STS_READ_SWAP_IDX_MSK                             (((1U<<MJENC_STS_READ_SWAP_IDX_LEN)-1)<<MJENC_STS_READ_SWAP_IDX_POS)
#define MJENC_STS_READ_SWAP_IDX_UMSK                            (~(((1U<<MJENC_STS_READ_SWAP_IDX_LEN)-1)<<MJENC_STS_READ_SWAP_IDX_POS))
#define MJENC_STS_SWAP_FSTART                                   MJENC_STS_SWAP_FSTART
#define MJENC_STS_SWAP_FSTART_POS                               (11U)
#define MJENC_STS_SWAP_FSTART_LEN                               (1U)
#define MJENC_STS_SWAP_FSTART_MSK                               (((1U<<MJENC_STS_SWAP_FSTART_LEN)-1)<<MJENC_STS_SWAP_FSTART_POS)
#define MJENC_STS_SWAP_FSTART_UMSK                              (~(((1U<<MJENC_STS_SWAP_FSTART_LEN)-1)<<MJENC_STS_SWAP_FSTART_POS))
#define MJENC_STS_SWAP_FEND                                     MJENC_STS_SWAP_FEND
#define MJENC_STS_SWAP_FEND_POS                                 (12U)
#define MJENC_STS_SWAP_FEND_LEN                                 (1U)
#define MJENC_STS_SWAP_FEND_MSK                                 (((1U<<MJENC_STS_SWAP_FEND_LEN)-1)<<MJENC_STS_SWAP_FEND_POS)
#define MJENC_STS_SWAP_FEND_UMSK                                (~(((1U<<MJENC_STS_SWAP_FEND_LEN)-1)<<MJENC_STS_SWAP_FEND_POS))

