sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_reg.h
/* 0x88 : mjpeg_start_addr1 */
#define MJENC_MJPEG_START_ADDR1_OFFSET                          (0x88)
#define MJENC_FRAME_START_ADDR_1                                MJENC_FRAME_START_ADDR_1
#define MJENC_FRAME_START_ADDR_1_POS                            (0U)
#define MJENC_FRAME_START_ADDR_1_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_1_MSK                            (((1U<<MJENC_FRAME_START_ADDR_1_LEN)-1)<<MJENC_FRAME_START_ADDR_1_POS)
#define MJENC_FRAME_START_ADDR_1_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_1_LEN)-1)<<MJENC_FRAME_START_ADDR_1_POS))

/* 0x8C : mjpeg_bit_cnt1 */
#define MJENC_MJPEG_BIT_CNT1_OFFSET                             (0x8C)
#define MJENC_FRAME_BIT_CNT_1                                   MJENC_FRAME_BIT_CNT_1
#define MJENC_FRAME_BIT_CNT_1_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_1_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_1_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_1_LEN)-1)<<MJENC_FRAME_BIT_CNT_1_POS)
#define MJENC_FRAME_BIT_CNT_1_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_1_LEN)-1)<<MJENC_FRAME_BIT_CNT_1_POS))

/* 0x90 : mjpeg_start_addr2 */
#define MJENC_MJPEG_START_ADDR2_OFFSET                          (0x90)
#define MJENC_FRAME_START_ADDR_2                                MJENC_FRAME_START_ADDR_2
#define MJENC_FRAME_START_ADDR_2_POS                            (0U)
#define MJENC_FRAME_START_ADDR_2_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_2_MSK                            (((1U<<MJENC_FRAME_START_ADDR_2_LEN)-1)<<MJENC_FRAME_START_ADDR_2_POS)
#define MJENC_FRAME_START_ADDR_2_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_2_LEN)-1)<<MJENC_FRAME_START_ADDR_2_POS))

/* 0x94 : mjpeg_bit_cnt2 */
#define MJENC_MJPEG_BIT_CNT2_OFFSET                             (0x94)
#define MJENC_FRAME_BIT_CNT_2                                   MJENC_FRAME_BIT_CNT_2
#define MJENC_FRAME_BIT_CNT_2_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_2_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_2_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_2_LEN)-1)<<MJENC_FRAME_BIT_CNT_2_POS)
#define MJENC_FRAME_BIT_CNT_2_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_2_LEN)-1)<<MJENC_FRAME_BIT_CNT_2_POS))

/* 0x98 : mjpeg_start_addr3 */
#define MJENC_MJPEG_START_ADDR3_OFFSET                          (0x98)
#define MJENC_FRAME_START_ADDR_3                                MJENC_FRAME_START_ADDR_3
#define MJENC_FRAME_START_ADDR_3_POS                            (0U)
#define MJENC_FRAME_START_ADDR_3_LEN                            (32U)
#define MJENC_FRAME_START_ADDR_3_MSK                            (((1U<<MJENC_FRAME_START_ADDR_3_LEN)-1)<<MJENC_FRAME_START_ADDR_3_POS)
#define MJENC_FRAME_START_ADDR_3_UMSK                           (~(((1U<<MJENC_FRAME_START_ADDR_3_LEN)-1)<<MJENC_FRAME_START_ADDR_3_POS))

/* 0x9C : mjpeg_bit_cnt3 */
#define MJENC_MJPEG_BIT_CNT3_OFFSET                             (0x9C)
#define MJENC_FRAME_BIT_CNT_3                                   MJENC_FRAME_BIT_CNT_3
#define MJENC_FRAME_BIT_CNT_3_POS                               (0U)
#define MJENC_FRAME_BIT_CNT_3_LEN                               (32U)
#define MJENC_FRAME_BIT_CNT_3_MSK                               (((1U<<MJENC_FRAME_BIT_CNT_3_LEN)-1)<<MJENC_FRAME_BIT_CNT_3_POS)
#define MJENC_FRAME_BIT_CNT_3_UMSK                              (~(((1U<<MJENC_FRAME_BIT_CNT_3_LEN)-1)<<MJENC_FRAME_BIT_CNT_3_POS))

/* 0x100 : mjpeg_q_enc */
#define MJENC_MJPEG_Q_ENC_OFFSET                                (0x100)
#define MJENC_FRAME_Q_SRAM_0                                    MJENC_FRAME_Q_SRAM_0
#define MJENC_FRAME_Q_SRAM_0_POS                                (0U)
#define MJENC_FRAME_Q_SRAM_0_LEN                                (1U)
#define MJENC_FRAME_Q_SRAM_0_MSK                                (((1U<<MJENC_FRAME_Q_SRAM_0_LEN)-1)<<MJENC_FRAME_Q_SRAM_0_POS)
#define MJENC_FRAME_Q_SRAM_0_UMSK                               (~(((1U<<MJENC_FRAME_Q_SRAM_0_LEN)-1)<<MJENC_FRAME_Q_SRAM_0_POS))
#define MJENC_FRAME_Q_SRAM_1                                    MJENC_FRAME_Q_SRAM_1
#define MJENC_FRAME_Q_SRAM_1_POS                                (1U)
#define MJENC_FRAME_Q_SRAM_1_LEN                                (1U)
#define MJENC_FRAME_Q_SRAM_1_MSK                                (((1U<<MJENC_FRAME_Q_SRAM_1_LEN)-1)<<MJENC_FRAME_Q_SRAM_1_POS)
#define MJENC_FRAME_Q_SRAM_1_UMSK                               (~(((1U<<MJENC_FRAME_Q_SRAM_1_LEN)-1)<<MJENC_FRAME_Q_SRAM_1_POS))
#define MJENC_FRAME_Q_SRAM_2                                    MJENC_FRAME_Q_SRAM_2
#define MJENC_FRAME_Q_SRAM_2_POS                                (2U)
#define MJENC_FRAME_Q_SRAM_2_LEN                                (1U)
#define MJENC_FRAME_Q_SRAM_2_MSK                                (((1U<<MJENC_FRAME_Q_SRAM_2_LEN)-1)<<MJENC_FRAME_Q_SRAM_2_POS)
#define MJENC_FRAME_Q_SRAM_2_UMSK                               (~(((1U<<MJENC_FRAME_Q_SRAM_2_LEN)-1)<<MJENC_FRAME_Q_SRAM_2_POS))
#define MJENC_FRAME_Q_SRAM_3                                    MJENC_FRAME_Q_SRAM_3
#define MJENC_FRAME_Q_SRAM_3_POS                                (3U)
#define MJENC_FRAME_Q_SRAM_3_LEN                                (1U)
#define MJENC_FRAME_Q_SRAM_3_MSK                                (((1U<<MJENC_FRAME_Q_SRAM_3_LEN)-1)<<MJENC_FRAME_Q_SRAM_3_POS)
#define MJENC_FRAME_Q_SRAM_3_UMSK                               (~(((1U<<MJENC_FRAME_Q_SRAM_3_LEN)-1)<<MJENC_FRAME_Q_SRAM_3_POS))
#define MJENC_REG_Q_SRAM_SW                                     MJENC_REG_Q_SRAM_SW
#define MJENC_REG_Q_SRAM_SW_POS                                 (24U)
#define MJENC_REG_Q_SRAM_SW_LEN                                 (1U)
#define MJENC_REG_Q_SRAM_SW_MSK                                 (((1U<<MJENC_REG_Q_SRAM_SW_LEN)-1)<<MJENC_REG_Q_SRAM_SW_POS)
#define MJENC_REG_Q_SRAM_SW_UMSK                                (~(((1U<<MJENC_REG_Q_SRAM_SW_LEN)-1)<<MJENC_REG_Q_SRAM_SW_POS))
#define MJENC_STS_Q_SRAM_ENC                                    MJENC_STS_Q_SRAM_ENC
#define MJENC_STS_Q_SRAM_ENC_POS                                (25U)
#define MJENC_STS_Q_SRAM_ENC_LEN                                (1U)
#define MJENC_STS_Q_SRAM_ENC_MSK                                (((1U<<MJENC_STS_Q_SRAM_ENC_LEN)-1)<<MJENC_STS_Q_SRAM_ENC_POS)
#define MJENC_STS_Q_SRAM_ENC_UMSK                               (~(((1U<<MJENC_STS_Q_SRAM_ENC_LEN)-1)<<MJENC_STS_Q_SRAM_ENC_POS))

/* 0x110 : mjpeg_frame_id_10 */
#define MJENC_MJPEG_FRAME_ID_10_OFFSET                          (0x110)
#define MJPEG_FRAME_ID_0                                        MJPEG_FRAME_ID_0
#define MJPEG_FRAME_ID_0_POS                                    (0U)
#define MJPEG_FRAME_ID_0_LEN                                    (16U)
#define MJPEG_FRAME_ID_0_MSK                                    (((1U<<MJPEG_FRAME_ID_0_LEN)-1)<<MJPEG_FRAME_ID_0_POS)
#define MJPEG_FRAME_ID_0_UMSK                                   (~(((1U<<MJPEG_FRAME_ID_0_LEN)-1)<<MJPEG_FRAME_ID_0_POS))
#define MJPEG_FRAME_ID_1                                        MJPEG_FRAME_ID_1
#define MJPEG_FRAME_ID_1_POS                                    (16U)
#define MJPEG_FRAME_ID_1_LEN                                    (16U)
#define MJPEG_FRAME_ID_1_MSK                                    (((1U<<MJPEG_FRAME_ID_1_LEN)-1)<<MJPEG_FRAME_ID_1_POS)
#define MJPEG_FRAME_ID_1_UMSK                                   (~(((1U<<MJPEG_FRAME_ID_1_LEN)-1)<<MJPEG_FRAME_ID_1_POS))

/* 0x1F0 : mjpeg_debug */
#define MJENC_MJPEG_DEBUG_OFFSET                                (0x1F0)
#define MJENC_REG_MJPEG_DBG_EN                                  MJENC_REG_MJPEG_DBG_EN
#define MJENC_REG_MJPEG_DBG_EN_POS                              (0U)
#define MJENC_REG_MJPEG_DBG_EN_LEN                              (1U)
#define MJENC_REG_MJPEG_DBG_EN_MSK                              (((1U<<MJENC_REG_MJPEG_DBG_EN_LEN)-1)<<MJENC_REG_MJPEG_DBG_EN_POS)
#define MJENC_REG_MJPEG_DBG_EN_UMSK                             (~(((1U<<MJENC_REG_MJPEG_DBG_EN_LEN)-1)<<MJENC_REG_MJPEG_DBG_EN_POS))
#define MJENC_REG_MJPEG_DBG_SEL                                 MJENC_REG_MJPEG_DBG_SEL
#define MJENC_REG_MJPEG_DBG_SEL_POS                             (4U)
#define MJENC_REG_MJPEG_DBG_SEL_LEN                             (4U)
#define MJENC_REG_MJPEG_DBG_SEL_MSK                             (((1U<<MJENC_REG_MJPEG_DBG_SEL_LEN)-1)<<MJENC_REG_MJPEG_DBG_SEL_POS)
#define MJENC_REG_MJPEG_DBG_SEL_UMSK                            (~(((1U<<MJENC_REG_MJPEG_DBG_SEL_LEN)-1)<<MJENC_REG_MJPEG_DBG_SEL_POS))

/* 0x1FC : mjpeg_dummy_reg */
#define MJENC_MJPEG_DUMMY_REG_OFFSET                            (0x1FC)
#define MJENC_MJPEG_DUMMY_REG                                   MJENC_MJPEG_DUMMY_REG
#define MJENC_MJPEG_DUMMY_REG_POS                               (0U)
#define MJENC_MJPEG_DUMMY_REG_LEN                               (32U)
#define MJENC_MJPEG_DUMMY_REG_MSK                               (((1U<<MJENC_MJPEG_DUMMY_REG_LEN)-1)<<MJENC_MJPEG_DUMMY_REG_POS)
#define MJENC_MJPEG_DUMMY_REG_UMSK                              (~(((1U<<MJENC_MJPEG_DUMMY_REG_LEN)-1)<<MJENC_MJPEG_DUMMY_REG_POS))


struct  mjenc_reg {
    /* 0x0 : mjpeg_control_1 */
    union {
        struct {
            uint32_t reg_mjpeg_enable               :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_mjpeg_bit_order            :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_order_u_even               :  1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t reg_last_hf_wblk_dmy           :  1; /* [    4],        r/w,        0x0 */
            uint32_t reg_last_hf_hblk_dmy           :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_reflect_dmy                :  1; /* [    6],        r/w,        0x0 */
            uint32_t reg_read_fwrap                 :  1; /* [    7],        r/w,        0x1 */
            uint32_t reg_w_xlen                     :  3; /* [10: 8],        r/w,        0x3 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_yuv_mode                   :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_23                 : 10; /* [23:14],       rsvd,        0x0 */
            uint32_t reg_mjpeg_hw_frame             :  6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_control_1;

    /* 0x4 : mjpeg_control_2 */
    union {
        struct {
            uint32_t reg_sw_frame                   :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5                     :  1; /* [    5],       rsvd,        0x0 */
            uint32_t reg_sw_kick                    :  1; /* [    6],        w1p,        0x0 */
            uint32_t reg_sw_kick_mode               :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_mode              :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_run               :  1; /* [    9],        r/w,        0x0 */
            uint32_t reg_yy_dvp2axi_sel             :  3; /* [12:10],        r/w,        0x0 */
            uint32_t reg_uv_dvp2axi_sel             :  3; /* [15:13],        r/w,        0x1 */
            uint32_t reg_mjpeg_wait_cycle           : 16; /* [31:16],        r/w,      0x400 */
        }BF;
        uint32_t WORD;
    } mjpeg_control_2;

    /* 0x08 : mjpeg_yy_frame_addr */
    union {
        struct {
            uint32_t reg_yy_addr_start              : 32; /* [31: 0],        r/w, 0x80000000 */
        }BF;
        uint32_t WORD;
    } mjpeg_yy_frame_addr;

